sinricpro/esp8266-esp32-sdk/examples/Switch/src/main.cpp
/*
 * Example for how to use SinricPro Switch device:
 * - setup a switch device
 * - handle request using callback (turn on/off builtin led indicating device power state)
 * - send event to sinricPro server (flash button is used to turn on/off device manually)
 */

#include <Arduino.h>
#ifdef ESP8266
  #include <ESP8266WiFi.h>
#endif
#ifdef ESP32
  #include <WiFi.h>
#endif

#include "SinricPro.h"
#include "SinricProSwitch.h"

#define WIFI_SSID         "YOUR-WIFI-SSID"
#define WIFI_PASS         "YOUR-WIFI-PASSWORD"
#define SOCKET_AUTH_TOKEN "YOUR-SOCKET-AUTH-TOKEN"
#define SIGNING_KEY       "YOUR-SIGNING-KEY"
#define SWITCH_ID         "YOUR-DEVICE-ID"

#define BTN_FLASH 0

SinricProSwitch mySwitch(SWITCH_ID);
bool myPowerState = false;
unsigned long lastBtnPress = 0;

/* bool onPowerState(String deviceId, bool &state) 
 *
 * Callback for setPowerState request
 * parameters
 *  String deviceId (r)
 *    contains deviceId (useful if this callback used by more devices)
 *  bool &state (r/w)
 *    contains the requested state (true:on / false:off)
 *    returns the new state
 * 
 * return
 *  true if request should be marked as handled correctly / false if not
 */
bool onPowerState(String deviceId, bool &state) {
  Serial.printf("Device %s turned %s (via SinricPro) \r\n", deviceId.c_str(), state?"on":"off");
  myPowerState = state;
  digitalWrite(LED_BUILTIN, myPowerState?LOW:HIGH);
  return true; // request handled properly
}

// setup function for WiFi connection
void setupWiFi() {
  Serial.printf("\r\n[Wifi]: Connecting");
  WiFi.begin(WIFI_SSID, WIFI_PASS);

  while (WiFi.status() != WL_CONNECTED) {
    Serial.printf(".");
    delay(250);
  }
  IPAddress localIP = WiFi.localIP();
  Serial.printf("connected!\r\n[WiFi]: IP-Address is %d.%d.%d.%d\r\n", localIP[0], localIP[1], localIP[2], localIP[3]);
}

// setup function for SinricPro
void setupSinricPro() {
  // set callback function to device
  mySwitch.onPowerState(onPowerState);
  // add device to SinricPro
  SinricPro.add(mySwitch);
  // setup SinricPro
  SinricPro.begin(SOCKET_AUTH_TOKEN, SIGNING_KEY);
}

// main setup function
void setup() {
  pinMode(BTN_FLASH, INPUT_PULLUP); // GPIO 0 as input, pulled high
  pinMode(LED_BUILTIN, OUTPUT); // define LED GPIO as output
  digitalWrite(LED_BUILTIN, HIGH); // turn off LED on bootup

  Serial.begin(115200);
  setupWiFi();
  setupSinricPro();
}

void loop() {
  // handle SinricPro communication
  SinricPro.handle();

  unsigned long actualMillis = millis(); // get actual millis() and keep it in variable actualMillis
  if (digitalRead(BTN_FLASH) == LOW && actualMillis - lastBtnPress > 1000)  { // is button pressed (inverted logic! button pressed = LOW) and debounced?
    if (myPowerState) {     // flip myPowerState: if it was true, set it to false, vice versa
      myPowerState = false;
    } else {
      myPowerState = true;
    }
    digitalWrite(LED_BUILTIN, myPowerState?LOW:HIGH); // if myPowerState indicates device turned on: turn on led (builtin led uses inverted logic: LOW = LED ON / HIGH = LED OFF)
    Serial.printf("Device %s turned %s (manually via flashbutton)\r\n", mySwitch.getDeviceId(), state?"on":"off");
  mySwitch.sendPowerStateEvent(myPowerState); // send the new powerState to SinricPro server
    lastBtnPress = actualMillis;  // update last button press variable
  } 
}
